{
  "title": "Instant Pot Beef Rice Pilaf",
  "about": "A hearty meal of rice and beef all cooked in one pot at a fraction of the time. The rice is well infused with the flavor of beef and spices and makes the best rice you will ever have!",
  "link": "https://letthebakingbegin.com/instant-pot-beef-rice-plov/",
  "info": {
    "yield": "6",
    "cook": "60min",
    "prep": "15min",
    "time": "75min"
  },
  "body": {
    "ingredients": [
      "1 1/2 lb beef, chuck, cubed to 1 inches, fat trimmed",
      "2 tbsp oil",
      "1 1/2 cup short-grain rice, rinsed until the water runs clear (well-drained)",
      "1 large onion, diced",
      "2 carrot, medium size, cut to 1/2 inch",
      "1/2 cup tomato sauce (optional, can be replaced with beef stock or water)",
      "1 1/2 cups beef broth (could be replaced with water)",
      "# Seasoning",
      "1 tsp black ground pepper",
      "1 tsp garlic powder",
      "1/2 tsp smoked paprika",
      "1 tsp beef seasoning (optional) ((I use Montreal Steak Seasoning))",
      "1 bay leaf",
      "2 tsp salt",
      "1 head garlic, cut in half horizontally",
      "1/4 cup chopped parsley"
    ],
    "instructions": [
      "Turn the Instant Pot to \"Saute\" function (30 min). When the display says \"Hot\" add 2 tbsp of oil and the 1 large diced onion and saute until lightly golden in color, about 5 minutes. Then add 2 cut up carrots, cubed beef and stir.",
      "Next, add ground pepper, garlic powder, smoked paprika, beef seasoning (if using), salt, tomato sauce, and bay leaf and the beef stock. Stir.",
      "Cover the Instant Pot with a lid, turn the steam valve to \"sealing\". Turn the pressure cooker to \"Manual\" and \"High\" heat for 45 minutes. Then once the time expires, cover the steam valve with a kitchen towel and turn it to \"venting\" to release pressure. Open the lid when the pressure is down.",
      "Remove the bay leaf. Sprinkle 1.5 cups of rice over the top (do not stir) and spread it evenly with a spoon (so all rice is covered with liquid). Press halved garlic head, cut side into the rice. Cover with lid, turn the steam valve to \"sealing\". Turn the Instant pot to \"Manual\" on \"High\" heat and set the timer to 15 minutes.",
      "After the time expires turn the Instant Pot off and allow to depressurize naturally for 15-20 minutes (this step is important). Next, turn the steam valve to \"venting\" and allow the rest of the steam to escape. Now open the lid, remove the garlic and squeeze it back into the rice (optional), add the parsley and gently fluff the rice with a fork for the ingredients to be evenly distributed."
    ],
    "nutrition": "**Serving size** 1 serving\n**Calories** 530 kcal\n**Fat** 28 g\n**Saturated fat** 9 g\n**Cholesterol** 80 mg\n**Sodium** 1273 mg\n**Carbohydrates** 43 g\n**Fiber** 2 g\n**Sugar** 2 g\n**Protein** 24 g",
    "notes": "Substitute for short grain rice\nUse Jasmine or Basmati rice in place of short grain. This will typically give you fluffier rice."
  },
  "tags": [
    "beef",
    "instant pot"
  ],
  "star": true
}