{
  "title": "Garlic Steak Bites",
  "about": "These tender, garlicky beef cubes are super addicting and the ultimate crowd pleaser! If you love garlic and you love steak, these Garlic Steak Bites will blow your mind. Every single cube is the perfect bite; this dish is perfect for garlic lovers like me! One of my favorite summer recipes is healthy and packed with protein and paired with a side of rice, Japanese Ginger salad, and Asian Honey Garlic Potato for the perfect meal.",
  "link": "https://tiffycooks.com/garlic-steak-bites/",
  "info": {
    "yield": "4",
    "cook": "10min",
    "prep": "10min",
    "time": "20min"
  },
  "body": {
    "ingredients": [
      "2 piece of steak",
      "1 1/2 tbsp oil",
      "2 tbsp soy sauce",
      "2 1/2 tbsp cooking wine (optional)",
      "1 1/2 tbsp of minced garlic",
      "1 pinch pepper",
      "1 tsp of baking soda",
      "6 cloves garlic (thinly sliced)",
      "1 green onion (chopped)",
      "1-2 tbsp margerine"
    ],
    "instructions": [
      "Cut steak into bite-sized pieces and marinate with tbsp of oil, soy sauce, cooking wine, minced garlic, pepper, and baking soda. Set aside for 10-20 minutes.",
      "In a pan, drizzle in oil (around 3 tbsp), and once the pan is hot, add in the sliced garlic. Let the garlic fry for 2-3 minutes until crispy and brown. This step will be fragrant the oil.",
      "Remove the garlic, and turn the heat up to medium-high. Add in the steak cubes and let them sit for 30 seconds - 1 minute.",
      "After 1 minute, fry on high heat for another 2-3 minutes. Add back in the garlic.",
      "OPTIONAL, add in 1-2 tbsp of margarine and fry for another 1 minute.",
      "Garnish with green onion and enjoy!"
    ],
    "notes": "Here are my secrets to SUPER TENDER Beef:\nThe first one is baking soda. I got this secret from a good friend who works at a Chinese restaurant; it is honestly a game-changer. No more eating tough beef at home, and hello to juicy, tender, silky beef!\nThe second tip is cutting against the grain. Always cut against the grain, so the meat doesn’t become over chewy. With this tip, it doesn’t matter what type of steak you get; it will turn out perfect every time!"
  },
  "tags": [
    "meat"
  ],
  "star": true
}