{
  "title": "Minestrone Soup",
  "about": "The Italians sure know how to make the ultimate vegetable soup. This one is easy on the waistline, but you’d never know it from how rich, comforting, and delicious it tastes.",
  "link": "https://recipes.instantpot.com/recipe/minestrone-soup-3/",
  "info": {
    "yield": "4-6",
    "cook": "5min",
    "prep": "10min",
    "time": "45min"
  },
  "body": {
    "ingredients": [
      "3 tbsp extra-virgin olive oil",
      "1 Spanish onion (or yellow, diced)",
      "2 large carrots (peeled and sliced into 1/4 inch disks and then into quarters)",
      "3 celery ribs (sliced)",
      "1 Zucchini (sliced into 1/4 inch disks and then into quarters)",
      "3 garlic cloves (minced or pressed)",
      "6 cups vegetable broth",
      "28 oz can crushed tomatoes ( I like San Marzano)",
      "14 1/2 oz can diced tomatoes",
      "15 1/2 oz can red kidney beans (drained and rinsed)",
      "15 1/2 oz can cannellini beans (drained and rinsed)",
      "1 tsp dried oregano",
      "1 tsp dried basil",
      "1/2 tsp dried thyme",
      "1 tsp black pepper",
      "2 tsp seasoned salt",
      "1 cup pipette pasta (ditalini or mini shells work well here too)",
      "10 oz box frozen cut green beans",
      "5-8 oz baby spinach",
      "grated parmesan cheese (for serving (optional))"
    ],
    "instructions": [
      "Place the olive oil in the Instant Pot and hit **Sauté** and Adjust so it’s on the **More or High** setting. After 3 minutes, once the oil is heated, add the onion, carrots, celery, and zucchini and cook for 5 minutes, stirring occasionally, until slightly softened. Add the garlic, mix well, and cook for another minute, until fragrant.",
      "Add the broth, crushed and diced tomatoes, kidney and cannellini beans, oregano, basil, thyme, pepper, and seasoned salt and stir.",
      "Stir in the pasta and frozen cut green beans, and top with the baby spinach but do not stir—just lay the spinach on top of the broth and veggies. It will seem like a lot and be close to the brim of the pot, but it cooks down to nothing.",
      "Secure the lid, move the valve to the sealing position, hit **Keep Warm/Cancel** and then on **High Pressure** for **5 minutes**, and follow with a **Quick Release** when done. Stir well.",
      "Serve topped with grated Parmesan, if desired, and some warm, crusty bread."
    ],
    "notes": "# Jeff’s Tips:\nThe soup will take a little while to come to pressure and to quick release due to all the liquid in the pot, so do be patient.\nDon’t want the extra Leave carbs? Leave out the pasta."
  },
  "tags": [
    "instant pot",
    "soup",
    "veggie"
  ],
  "star": true
}